from sqlalchemy.orm import Session

import models


region_list=[
    {"name":"サロベツ", "max_x":398, "min_x":390, "max_y":135, "min_y":126, "islands":["礼文島","利尻島"]},
    {"name":"道北", "max_x":398, "min_x":391, "max_y":147, "min_y":140, "islands":["焼尻島","天売島"]},
    {"name":"道南", "max_x":368, "min_x":360, "max_y":184, "min_y":176, "islands":["奥尻島"]},
    {"name":"宮城", "max_x":382, "min_x":370, "max_y":254, "min_y":240, "islands":["大島","出島","江島","網地島","田代島","寒風沢島","野々島","桂島","朴島","金華山","宮戸島"]},
    {"name":"山形", "max_x":360, "min_x":355, "max_y":230, "min_y":225, "islands":["飛島"]},
    {"name":"伊豆", "max_x":344, "min_x":337, "max_y":305, "min_y":298, "islands":["大島","利島","新島","式根島","神津島"]},
    {"name":"伊豆南部", "max_x":350, "min_x":340, "max_y":320, "min_y":306, "islands":["三宅島","御蔵島","八丈島","青ヶ島"]},
    {"name":"小笠原", "max_x":380, "min_x":360, "max_y":408, "min_y":360, "islands":["父島","母島","硫黄島",""]},
    {"name":"新潟", "max_x":350, "min_x":330, "max_y":255, "min_y":240, "islands":["粟島","佐渡島"]},
    {"name":"能登", "max_x":320, "min_x":315, "max_y":260, "min_y":245, "islands":["舳倉島","能登島"]},
    {"name":"熱海", "max_x":342, "min_x":337, "max_y":297, "min_y":294, "islands":["初島"]},
    {"name":"三河", "max_x":313, "min_x":308, "max_y":298, "min_y":295, "islands":["佐久島","日間賀島","篠島"]},
    {"name":"伊勢志摩", "max_x":310, "min_x":305, "max_y":305, "min_y":300, "islands":["神島","答志島","菅島","坂手島","渡鹿野島","間崎島","賢島","横山島"]},
    {"name":"琵琶湖", "max_x":300, "min_x":295, "max_y":292, "min_y":287, "islands":["沖島"]},
    {"name":"あわじ", "max_x":285, "min_x":278, "max_y":302, "min_y":292, "islands":["淡路島","沼島","大毛島","島田島"]},
    {"name":"南紀", "max_x":300, "min_x":290, "max_y":318, "min_y":310, "islands":["中ノ島","紀伊大島"]},
    {"name":"隠岐", "max_x":265, "min_x":255, "max_y":272, "min_y":265, "islands":["島後島","中ノ島","西ノ島","知夫里島"]},
    {"name":"瀬戸内東部", "max_x":277, "min_x":262, "max_y":300, "min_y":292, "islands":["家島","男鹿島","坊勢島","西島","鹿久居島","大多府島","頭島","鴻島","鴻島","長島","前島","黄島","黒島","犬島","石島","松島","六口島","高島","白石島","北木島","真鍋島","小飛島","大飛島","六島","走島","小豆島","沖之島","小豊島","豊島","直島","向島","屏風島","大島","男木島","女木島","櫃石島","岩黒島","与島","小与島","牛島","本島","広島","手島","小手島","高見島","佐柳島","粟島","志々島","伊吹島"]},
    {"name":"瀬戸内西部", "max_x":261, "min_x":238, "max_y":300, "min_y":292, "islands":["田島","横島","百島","向島（広島）","岩子島","細島","因島","佐木島","小佐木島","生口島","高根島","大久野島","契島","生野島","大崎上島","大崎下島","長島（広島）","三角島","豊島","斎島","大芝島","上蒲刈島","下蒲刈島","情島","似島","金輪島","江田島・能美島","沖野島","倉橋島","鹿島","厳島","阿多田島","端島","柱島","黒島","屋代島","笠佐島","前島","浮島","情島","沖家室島","平郡島","長島（山口）","八島","祝島","佐合島","馬島","牛島","笠戸島","粭島","大津島","野島","向島（山口）",
    "魚島","高井神島","弓削島","佐島","生名島","岩城島","赤穂根島","大三島","伯方島","鵜島","大島","津島","岡村島","小大下島","大下島","来島","小島","馬島","比岐島","新居大島","安居島","興居島","釣島","野忽那島","睦月島","中島","怒和島","津和地島","二神島","青島"]},
    {"name":"宇和", "max_x":250, "min_x":244, "max_y":320, "min_y":305, "islands":["大島（八幡浜）","九島","嘉島","戸島","日振島","竹ケ島","柏島","大島（宿毛）","鵜来島","沖の島"]},
    {"name":"土佐", "max_x":262, "min_x":255, "max_y":314, "min_y":308, "islands":["中ノ島","戸島"]},
    {"name":"室戸阿南", "max_x":282, "min_x":270, "max_y":310, "min_y":303, "islands":["伊島","出羽島","竹ヶ島"]},
    {"name":"下関", "max_x":233, "min_x":226, "max_y":298, "min_y":288, "islands":["竹ノ子島","彦島","角島","蓋井島","六連島","馬島","藍島","地島"]},
    {"name":"長門・萩", "max_x":240, "min_x":234, "max_y":290, "min_y":280, "islands":["見島","相島","櫃島","青海島"]},
    {"name":"玄界灘", "max_x":225, "min_x":208, "max_y":305, "min_y":280, "islands":["大島（福岡）","相島","志賀島","能古島","玄界島","小呂島","姫島","高島（佐賀）","神集島","加部島","小川島","加唐島","松島","馬渡島","向島","対馬島","海栗島","赤島","泊島","沖ノ島","島山島","壱岐島","大島（壱岐）","長島","原島","若宮島","福島","鷹島","黒島","飛島","青島","的山大島","度島","平戸島","高島（平戸）","生月島","鵜瀬島"]},
    {"name":"長崎", "max_x":219, "min_x":208, "max_y":315, "min_y":306, "islands":["前島（佐世保）","鼕泊島","黒島","高島（佐世保）","針尾島","大島（佐世保）","竹島","前島（時津）","鹿島","大島（西海）","寺島","蛎浦島","崎戸島","南串島","松島","池島","伊王島","沖之島","高島（長崎市）","樺島","牧島","軍艦島"]},
    {"name":"五島", "max_x":207, "min_x":195, "max_y":317, "min_y":305, "islands":["江島","平島","宇久島","寺島","六島","野崎島","納島","小値賀島","斑島","黒島（小値賀）","大島","中通島","頭ケ島","桐ノ小島","若松島","漁生浦島","有福島","日ノ島","奈留島","前島","久賀島","蕨小島","椛島","福江島","赤島","黄島","黒島（五島）","島山島","嵯峨島"]},
    {"name":"天草", "max_x":225, "min_x":212, "max_y":322, "min_y":316, "islands":["戸馳島","大矢野島","維和島","野牛島","湯島","野釜島","永浦島","樋合島","前島","中島","天草上島","樋島","御所浦島","牧島","横浦島","天草下島","通詞島","横島","下須島","獅子島","伊唐島","諸浦島","長島","桂島"]},
    {"name":"大分", "max_x":243, "min_x":235, "max_y":315, "min_y":301, "islands":["姫島","黒島","保戸島","地無垢島","大入島","大島","屋形島","深島"]},
    {"name":"宮崎", "max_x":243, "min_x":229, "max_y":334, "min_y":316, "islands":["島野浦島","大島","築島"]},
    {"name":"鹿児島西部", "max_x":215, "min_x":208, "max_y":332, "min_y":325, "islands":["上甑島","中甑島","下甑島"]},
    {"name":"薩南", "max_x":226, "min_x":208, "max_y":342, "min_y":338, "islands":["種子島","馬毛島","屋久島","口永良部島","竹島","硫黄島","黒島","口之島","中之島","諏訪之瀬島","平島","悪石島","小宝島","宝島","奄美大島","加計呂麻島","請島","与路島","喜界島","徳之島","沖永良部島","与論島"]},
    {"name":"沖縄", "max_x":207, "min_x":196, "max_y":354, "min_y":340, "islands":["伊平屋島","野甫島","伊是名島","宮城島（大宜味村）","古宇利島","屋我地島","伊江島","瀬底島","水納島","平安座島","宮城島（うるま）","伊計島","浜比嘉島","津堅島","久高島","奥島","瀬長島"]},
    {"name":"大東", "max_x":230, "min_x":225, "max_y":357, "min_y":352, "islands":["南大東島","北大東島"]},
    {"name":"慶良間", "max_x":195, "min_x":188, "max_y":352, "min_y":347, "islands":["前島","渡嘉敷島","座間味島","阿嘉島","慶留間島"]},
    {"name":"島尻郡西部", "max_x":187, "min_x":176, "max_y":347, "min_y":340, "islands":["粟国島","渡名喜島","久米島","奥武島","オーハ島"]},
    {"name":"宮古", "max_x":175, "min_x":160, "max_y":410, "min_y":382, "islands":["宮古島","池間島","大神島","来間島","伊良部島","下地島","多良間島","水納島"]},
    {"name":"八重山", "max_x":159, "min_x":140, "max_y":420, "min_y":385, "islands":["石垣島","竹富島","小浜島","嘉弥真島","黒島","新城島","西表島","由布島","鳩間島","波照間島","与那国島"]},
]


def create(db: Session):
    for region in region_list:
        islands = [models.Island(name=island_name) for island_name in region["islands"]]
        region_data = {
            "name": region["name"],
            "max_x_position": region["max_x"],
            "min_x_position": region["min_x"],
            "max_y_position": region["max_y"],
            "min_y_position": region["min_y"],
            "islands": islands,
        }
        db_region = models.Region(**region_data)
        db.add(db_region)
        db.commit()
        db.refresh(db_region)